Tekla.Structures.Model.Operations.Operation.IFCExportFlags
Boolean flags for IFC 4 export.

Tekla.Structures.Model.Operations.Operation.IFCExportFlags.IsFlatBeamsAsPlates
Export flat beams as plates.

Tekla.Structures.Model.Operations.Operation.IFCExportFlags.IsLocationFromOrganizer
Get locations from organizer.

Tekla.Structures.Model.Operations.Operation.IFCExportFlags.IsLocationFromBuildingHierarchy
Get locations from Building Hierarchy.

Tekla.Structures.Model.Operations.Operation.IFCExportFlags.IsPoursEnabled
Pours export is enabled. True for pours, false for CIP cast-units and/or parts

Tekla.Structures.Model.Operations.Operation.IFCExportFlags.ExportRebarSetGroupAsIndividualBars
Rebar set group individual bars export is enabled.

Tekla.Structures.Model.Operations.Operation.IFCExportFlags.IsAssembliesEnabled
Boolean indicating whether the assemblies export is enabled.
Deprecated since TS v2026.

Tekla.Structures.Model.Operations.Operation.IFCExportFlags.IncludeAssemblyHierarchy
Boolean indicating whether to include assembly hierarchy (IFCELEMENTASSEMBLY) objects to export result.

Tekla.Structures.Model.Operations.Operation.IFCExportFlags.IsBoltsEnabled
Boolean indicating whether the bolts export is enabled.

Tekla.Structures.Model.Operations.Operation.IFCExportFlags.IsWeldsEnabled
Boolean indicating whether the welds export is enabled.

Tekla.Structures.Model.Operations.Operation.IFCExportFlags.IsGridsEnabled
Boolean indicating whether the grids export is enabled.

Tekla.Structures.Model.Operations.Operation.IFCExportFlags.IsRebarsEnabled
Boolean indicating whether the rebars export is enabled.

Tekla.Structures.Model.Operations.Operation.IFCExportFlags.IsSurfaceTreatmentsAndSurfacesEnabled
Boolean indicating whether the surfaces and surface treatments export is enabled.

Tekla.Structures.Model.Operations.Operation.IFCExportFlags.UseIfcMapConversion
Boolean indicating whether to use IfcMapConversion with base points is enabled.
By default IFC4 export should use IfcMapConversion. Uninitialized null will be converted to true during export.

Tekla.Structures.Model.Operations.Operation.IFCExportFlags.IsSpacesEnabled
Boolean indicating whether the export of spaces in building hierarchy is enabled.